---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsComponentConnection.PeerConnectionType
source: html/cf8457a9-9fac-0bab-6ca3-4ba3b79d872f.htm
---
# Autodesk.Revit.DB.Architecture.StairsComponentConnection.PeerConnectionType Property

The connection type of the peer connected stairs component.

## Syntax (C#)
```csharp
public StairsComponentConnectionEndType PeerConnectionType { get; }
```